#22.01
"""
Умова задачі: Визначте, що це за число, якщо відомо, що воно трьохзначне та складається з цифр, які зліва направо збільшуються.
Якщо ж це трьохзначне число прочитати, то усі слова в ньому будуть починатися на одну літеру.
Відповідь: 147
"""

once = {
    1:"один",
    2:"два",
    3:"три",
    4:"чотири",
    5:"п'ять",
    6:"шість",
    7:"сім",
    8:"вісім",
    9:"девять",
    0:""
}

tens = {
    1:"десять",
    2:"двадцять",
    3:"тридцять",
    4:"сорок",
    5:"п'ятдесят",
    6:"шістдесят",
    7:"сімдесят",
    8:"вісімдесят",
    9:"девяносто",
    0:""
}

hundret = {
    1:"сто",
    2:"двісті",
    3:"триста",
    4:"чотириста",
    5:"п'ятсот",
    6:"шістсот",
    7:"сімсот",
    8:"вісімсот",
    9:"девятсот",
    0:""
}

if __name__ == '__main__':
    number = [int]
    literal = "с"

    for h in hundret:
        if hundret[h].find(literal) == 0:

            for t in tens:
                if t > h:
                    if tens[t].find(literal) == 0:

                        for o in once:
                            if o > t:
                                if once[o].find(literal) == 0:
                                    number = [h, t, o]
    
    print(number)
    print(f"{hundret[number[0]]} {tens[number[1]]} {once[number[2]]}")
